app/controllers/appointments_controller.rb

  def index
    @appointments = Appointment.all
---
SELECT "appointments".* FROM "appointments"

  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save
---
INSERT INTO "appointments" ("created_at", "customer_id", "date", "reason", "time", "updated_at", "vehicle_id") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_appointment
      @appointment = Appointment.find(params[:id])
---
SELECT  "appointments".* FROM "appointments"  WHERE "appointments"."id" = ? LIMIT 1  [["id", 1]]