app/controllers/customers_controller.rb

  def index
    @customers = Customer.all
---
SELECT `customers`.* FROM `customers`

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO `customers` (`address`, `created_at`, `email`, `name`, `phone_number`, `updated_at`) VALUES ('502 NE chipman rd apt 41', '2014-10-14 03:04:34', '', 'krishna teja vemulapalli', '8608415479', '2014-10-14 03:04:34')

  def destroy
    @customer.destroy
---
DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 4]]

    def set_customer
      @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers"  WHERE "customers"."id" = ? LIMIT 1  [["id", 4]]