app/controllers/vehicles_controller.rb

  def index
    @vehicles = Vehicle.all
---
SELECT `vehicles`.* FROM `vehicles`