app/controllers/vehicles_controller.rb

  def create
    @vehicle = Vehicle.new(vehicle_params)

    respond_to do |format|
      if @vehicle.save
---
INSERT INTO "vehicles" ("created_at", "customer_id", "manufacturer", "model", "name", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", "2014-10-11 20:26:40.672502"], ["customer_id", 4], ["manufacturer", "benz"], ["model", "s-class"], ["name", "benz"], ["updated_at", "2014-10-11 20:26:40.672502"], ["year", 2014]]

  def update
    respond_to do |format|
      if @vehicle.update(vehicle_params)
---
UPDATE `vehicles` SET `customer_id` = 2, `updated_at` = '2014-10-14 03:47:50' WHERE `vehicles`.`id` = 2

  def destroy
    @vehicle.destroy
---
DELETE FROM `vehicles` WHERE `vehicles`.`id` = 6

    def set_vehicle
      @vehicle = Vehicle.find(params[:id])
---
SELECT  "vehicles".* FROM "vehicles"  WHERE "vehicles"."id" = ? LIMIT 1  [["id", 1]]

    def set_customer
      @customer = Customer.find(params[:customer_id])
---
SELECT  `customers`.* FROM `customers`  WHERE `customers`.`id` = 1 LIMIT 1