app/views/vehicles/_form.html.erb

SELECT `customers`.* FROM `customers`   ORDER BY `customers`.`name` ASC
---
    <%= f.label :customer_id %><br>
    <%= f.collection_select :customer_id, Customer.order(:name),:id,:name, include_blank: false %>